import {Fragment} from "react";

const DUMMY_DATA = [
    {
        id: 'i1',
        intro: [
            {
                image: 'images/about/intro/intro.webp',
                title: 'تاسیس بیمه آرمان',
                desc: <Fragment>
                    <p>
                        شرکت بیمه آرمان  ( سهامی عام )  به موجب قانون تاسیس بیمه گری  و با مجوز  شماره ۴۱۹۸۰۱ بیمــه مرکزی جمهوری اسلامی ایـران در تاریخ   ۱۳۹۰/۱۰/۰۷  در اداره ثبت شرکتها و مؤسسات غیر تجاری، به ثبت رسید و  پروانه فعالیت بیمه گری  در انواع  رشته های بیمه ای را تحت شماره ۴۳۵۴۱/۹۰ مورخ  ۱۳۹۰/۱۱/۱۸  بیمه مرکزی  جمهوری اسلامی  ایران دریافت کرد.
                    </p>
                    <p>
                        سرمایه اولیه شرکت در زمان تأسیس ۶۰۰ میلیارد ریال بود که با مشارکت شرکت ها و بنگاههای مالی، اقتصادی و خدماتی در اداره  ثبت شرکت  در تهران به ثبت رسید. هیأت مدیرهشرکت  به منظور  حضور قدرتمند در بازار بیمه و سرمایه کشور، افزایش سرمایه شرکت را تا مبلغ ۲۶۴۰میلیارد ریال در تاریخ ۱۳۹۱/۰۳/۰۹ تصویب کرد و به دنبال آن مجمع عمومی فوق العاده در تاریخ ۱۳۹۲/۰۴/۰۲ تشکیل شد و خذ مجوز افزایش سرمایه از بیمه مرکزی ج.ا.ا وسازمان  بورس اوراق بهادار، سهامداران با افزایش سرمایه شرکت موافقت کردند
                    </p>
                </Fragment>,
            }
        ]
    },
];

export const aboutData = () => {
    return DUMMY_DATA;
};