const DUMMY_EXPENSES = [
    {
        id: 'e1',
        city: 'تهران',
        title: 'تهران (شعبه شرق)',
        manager: ' سعید افخمی اردکانی',
        tel: ' 775445791 - 77544556 - 775445826',
        address: ' خیابان نیروی هوایی - خیابان شهید رستگار صولتی - خیابان امامت - پلاک 9',
        postCard: '17434567886',
    },
    {
        id: 'e2',
        city: 'تهران',
        title: 'تهران (شعبه غرب)',
        manager: ' سعید افخمی اردکانی',
        tel: ' 775445791 - 77544556 - 775445826',
        address: ' خیابان نیروی هوایی - خیابان شهید رستگار صولتی - خیابان امامت - پلاک 9',
        postCard: '17434567886',
    },
    {
        id: 'e2',
        city: 'اصفهان',
        title: 'اصفهان (شعبه غرب)',
        manager: ' سعید افخمی اردکانی',
        tel: ' 775445791 - 77544556 - 775445826',
        address: ' خیابان نیروی هوایی - خیابان شهید رستگار صولتی - خیابان امامت - پلاک 9',
        postCard: '17434567886',
    },
];

export const allBranches = () => {
    return DUMMY_EXPENSES;
};