const DUMMY_DATA = [
    {
        id: 'c1',
        question: 'ماده 1 : کلیات',
        answer: <div>
            <p>
                جمله اول:
            </p>
            <p>لورم ایپسوم متن ساختگی تست</p>
            <p>لورم ایپسوم متن ساختگی تست</p>
            <p>لورم ایپسوم متن ساختگی تست</p>
            <p>لورم ایپسوم متن ساختگی تست</p>
        </div>
    },
    {
        id: 'c2',
        question: 'ماده ۲ : تعهدات بیمه‌گر',
        answer: <div>
            <p>
                جمله اول:
            </p>            <p>لورم ایپسوم متن ساختگی تست</p>
            <p>لورم ایپسوم متن ساختگی تست</p>
            <p>لورم ایپسوم متن ساختگی تست</p>
            <p>لورم ایپسوم متن ساختگی تست</p>
        </div>
    },
    {
        id: 'c3',
        question: 'ماده ۳ : استثنائات',
        answer: <div>
            <p>
                جمله اول:
            </p>            <p>لورم ایپسوم متن ساختگی تست</p>
            <p>لورم ایپسوم متن ساختگی تست</p>
            <p>لورم ایپسوم متن ساختگی تست</p>
            <p>لورم ایپسوم متن ساختگی تست</p>
        </div>
    },
    {
        id: 'c4',
        question: 'ماده ۴ : وظایف بیمه‌شده',
        answer: <div>
            <p>
                جمله اول:
            </p>            <p>لورم ایپسوم متن ساختگی تست</p>
            <p>لورم ایپسوم متن ساختگی تست</p>
            <p>لورم ایپسوم متن ساختگی تست</p>
            <p>لورم ایپسوم متن ساختگی تست</p>
        </div>
    },
    {
        id: 'c5',
        question: 'ماده ۵ : ارجاع به داوری',
        answer: <div>
            <p>
                جمله اول:
            </p>            <p>لورم ایپسوم متن ساختگی تست</p>
            <p>لورم ایپسوم متن ساختگی تست</p>
            <p>لورم ایپسوم متن ساختگی تست</p>
            <p>لورم ایپسوم متن ساختگی تست</p>
        </div>
    },
    {
        id: 'c6',
        question: 'ماده ۶ : مهلت اقامه دعوا',
        answer: <div>
            <p>
                جمله اول:
            </p>
            <p>لورم ایپسوم متن ساختگی تست</p>
            <p>لورم ایپسوم متن ساختگی تست</p>
            <p>لورم ایپسوم متن ساختگی تست</p>
            <p>لورم ایپسوم متن ساختگی تست</p>
        </div>
    },
    {
        id: 'c7',
        question: 'ماده ۷ : سایر شرایط',
        answer: <div>
            <p>
                جمله اول:
            </p>
            <p>لورم ایپسوم متن ساختگی تست</p>
            <p>لورم ایپسوم متن ساختگی تست</p>
            <p>لورم ایپسوم متن ساختگی تست</p>
            <p>لورم ایپسوم متن ساختگی تست</p>
        </div>
    },
];

export const getAllConditions = () => {
    return DUMMY_DATA;
};