const DUMMY_DATA = [
    {
        id: 'v1',
        title: 'تجمیع و تخصیص امکانات به منظور حضور شرکت بیمه ای پیشرو، سرآمد و متعالی در سطح کشور و در صورت امکان در عرصه های منطقه ای',
    },
    {
        id: 'v2',
        title: ' ارائه خدمات بیمه ای متفاوت و متمایز مطابق با نیازهای جامعه و بازار بیمه کشور',
    },
    {
        id: 'v3',
        title: 'مشارکت موثر و تلاش به منظور افزایش ضریب نفوذ بیمه های بازرگانی',
    },
    {
        id: 'v4',
        title: 'سرمایه گذاری بهینه منابع و کسب سود منطقی، مناسب و پایدار',
    },
    {
        id: 'v5',
        title: 'مشارکت موثر و فعال در مراکز سیاست گذاری و تصمیم سازی صنعت بیمه از قبیل شورای عالی بیمه و سندیکای بیمه گران ایران',
    },
    {
        id: 'v6',
        title: 'تلاش در جهت توزیع مناسب ریسک و تقلیل خروج ارز از کشور',
    },
    {
        id: 'v7',
        title: 'جذب کارکنان توانمند و آشنا به امور و ارتقای دانش فنی و آموزش مستمر آنان',
    },
    {
        id: 'v8',
        title: '  گسترش جفرافیایی خدمات با ایجاد شبکه فروش فعال، حرفه ای و کارآمد',
    },
];

export const getAllVision = () => {
    return DUMMY_DATA;
};